app/controllers/api/v1/redirect_controller.rb

SELECT "exit_deliveries".* FROM "exit_deliveries" WHERE "exit_deliveries"."status" = $1 AND "exit_deliveries"."is_default" = $2 LIMIT $3  [["status", "sold"], ["is_default", true], ["LIMIT", 1]]
---
  def get_url deliveries, status
    redirect_count = deliveries.any? ? deliveries.sum(&:count) :  0
    deliveries.each do |delivery|
      percent = (delivery.count.to_f / (redirect_count+1) ) * 100
      if percent <= delivery.percentage
        return {url: delivery.url, id: delivery.id}
      end
    end

    {url: ExitDelivery.find_by(status: status, is_default: true).url, id: ExitDelivery.find_by(status: status, is_default: true).id }